;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;					PSI ABILITIES - PASSIVE						;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

[BS_Unstable X2AbilityTemplate]
LocFriendlyName="Unstable"
LocLongDescription="The soldier deals <Ability:UNSTABLE_DAMAGE_DEALT_BONUS_PERCENTAGE/>% increased damage with offensive Psionic abilities, but using an offensive Psionic ability has a <Ability:UNSTABLE_PANIC_CHANCE/>% chance to make them panic."
LocHelpText="Increases damage dealt with offensive Psionic abilties by <Ability:UNSTABLE_DAMAGE_DEALT_BONUS_PERCENTAGE/>. Using an offensive Psionic ability has a <Ability:UNSTABLE_PANIC_CHANCE/>% chance to cause the soldier to panic."
LocFlyOverText="Unstable"
LocPromotionPopupText="<Bullet/> Items and abilities such as Mindshield and Solace which make the soldier immune to mental conditions will remove the chance to panic.<br/>"

[BS_OpenMind X2AbilityTemplate]
LocFriendlyName="Open Mind"
LocLongDescription="Increases Psi Offense by <Ability:OPEN_MIND_PSI/> but reduces Will by <Ability:OPEN_MIND_WILL/>."
LocHelpText="Increases Psi Offense by <Ability:OPEN_MIND_PSI/> but reduces Will by <Ability:OPEN_MIND_WILL/>."
LocFlyOverText="Open Mind"
;LocPromotionPopupText="Increases Psi Offense by <Ability:OPEN_MIND_PSI/> but reduces Will by <Ability:OPEN_MIND_WILL/>."

[BS_PsionicAtrophy X2AbilityTemplate]
LocFriendlyName="Psionic Atrophy"
LocLongDescription="Increases Psi Offense by <Ability:PSIONIC_ATROPHY_PSI/> and grants immunity to Psionic damage and Mental effects. Damage taken from all other sources is increased by <Ability:PSIONIC_ATROPHY_DAMAGE_TAKEN_MODIFIER/>%."
LocHelpText="Increases Psi Offense and grants immunity to Psionic damage and Mental effects. Damage taken from all other sources is increased."
LocFlyOverText="Psionic Atrophy"
;LocPromotionPopupText="Increases Psi Offense by 15 and grants immunity to psionic damage and mental effects. Damage taken from all other sources is increased by 33%."

[BS_BattleMeditation X2AbilityTemplate]
LocFriendlyName="Battle Meditation"
LocLongDescription="Hunker Down increases your Psi Offense by <Ability:BATTLE_MEDITATION_PSI/> and your Will by <Ability:BATTLE_MEDITATION_WILL/> for <Ability:BATTLE_MEDITATION_DURATION/> turn(s)."
LocHelpText="Hunker Down increases your Psi Offense by <Ability:BATTLE_MEDITATION_PSI/> and your Will by <Ability:BATTLE_MEDITATION_WILL/> for <Ability:BATTLE_MEDITATION_DURATION/> turn(s)."
LocFlyOverText="Battle Meditation"
LocPromotionPopupText="<Bullet/> This effect does not stack.<br/>"

[BS_MindOverMatter X2AbilityTemplate]
LocFriendlyName="Mind Over Matter"
LocLongDescription="Whenever this soldier takes damage, the cooldowns of their Psionic abilities are reduced by <Ability:MIND_OVER_MATTER_CD_AMOUNT/>."
LocHelpText="Taking damage reduces the cooldown of all Psionic abilities by <Ability:MIND_OVER_MATTER_CD_AMOUNT/>."
LocFlyOverText="Mind Over Matter: Cooldowns reduced"
LocPromotionPopupText="<Bullet/> Can be triggered multiple times per turn.<br/>"

[BS_MindThief X2AbilityTemplate]
LocFriendlyName="Spirit Thief"
LocLongDescription="Killing a psionic enemy increases Psi Offense by <Ability:MIND_THIEF_PSI/> and damage dealt with offensive Psionic abilities by <Ability:MIND_THIEF_DAMAGE_DEALT_BONUS_PERCENTAGE/>% for <Ability:MIND_THIEF_DURATION/> turns."
LocHelpText="Killing a psionic enemy increases Psi Offense by <Ability:MIND_THIEF_PSI/> and damage dealt with offensive Psionic abilities by <Ability:MIND_THIEF_DAMAGE_DEALT_BONUS_PERCENTAGE/> for <Ability:MIND_THIEF_DURATION/> turns."
LocFlyOverText="Spirit Thief"
LocPromotionPopupText="<Bullet/> Can be triggered with any weapon, item or ability.<br/><Bullet/> This effect does not stack.<br/><Bullet/> Lasts for <Ability:MIND_THIEF_DURATION/> turns.<br/>"


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;					PSI ABILITIES - ACTIVE						;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

[BS_StrainMind X2AbilityTemplate]
LocFriendlyName="Psionic Conduit"
LocLongDescription="Activate to make the next Psionic ability a free action. Each time Psionic Conduit is activated, the soldier's Will is reduced by <Ability:STRAIN_MIND_WILL_LOSS/>. When the soldier's Will falls below <Ability:STRAIN_MIND_DAMAGE_PENALTY_WILL_THRESHOLD/>%, Psionic abilities deal <Ability:STRAIN_MIND_DAMAGE_DEALT_PENALTY_PERCENTAGE/>% reduced damage and Psi Offense is reduced by <Ability:STRAIN_MIND_PSI_OFFENSE_PENALTY_MULTIPLIER/>%."
LocHelpText="Activate to make the next Psionic ability a free action."
LocFlyOverText="Psionic Conduit"
LocPromotionPopupText="<Bullet/> Activate to make the next Psionic ability a free action.<br/><Bullet/> Each time Psionic Conduit is activated, the soldier's Will is reduced by <Ability:STRAIN_MIND_WILL_LOSS/>.<br/><Bullet/> When the soldier's Will falls below <Ability:STRAIN_MIND_DAMAGE_PENALTY_WILL_THRESHOLD/>%, Psionic abilities deal <Ability:STRAIN_MIND_DAMAGE_DEALT_PENALTY_PERCENTAGE/>% reduced damage.<br/><Bullet/> <Ability:STRAIN_MIND_COOLDOWN/> turn cooldown.<br/>"

[BS_StrainMindPassive X2AbilityTemplate]
LocFriendlyName="Psionic Conduit"
LocLongDescription="Activating Psionic Conduit makes the next Psionic ability a free action. Each time Psionic Conduit is activated, the soldier's Will is reduced by <Ability:STRAIN_MIND_WILL_LOSS/>. When the soldier's Will falls below <Ability:STRAIN_MIND_DAMAGE_PENALTY_WILL_THRESHOLD/>%, Psionic abilities deal <Ability:STRAIN_MIND_DAMAGE_DEALT_PENALTY_PERCENTAGE/>% less damage and Psi Offense is reduced by <Ability:STRAIN_MIND_PSI_OFFENSE_PENALTY_MULTIPLIER/>%. <Ability:STRAIN_MIND_DAMAGE_PENALTY_WILL_THRESHOLD/> turn cooldown."
LocHelpText="This soldier's mind was overly strained and their Will dropped below <Ability:STRAIN_MIND_DAMAGE_PENALTY_WILL_THRESHOLD/>%. Psi Offense is reduced by <Ability:STRAIN_MIND_PSI_OFFENSE_PENALTY_MULTIPLIER/>% and Psionic abilities deal <Ability:STRAIN_MIND_DAMAGE_DEALT_PENALTY_PERCENTAGE/>% reduced damage."
LocPromotionPopupText="<Bullet/> Activate to make the next Psionic ability a free action.<br/><Bullet/> Each time Psionic Conduit is activated, the soldier's Will is reduced by <Ability:STRAIN_MIND_WILL_LOSS/>.<br/><Bullet/> When under <Ability:STRAIN_MIND_DAMAGE_PENALTY_WILL_THRESHOLD/>% Will, Psionic abilities deal <Ability:STRAIN_MIND_DAMAGE_DEALT_PENALTY_PERCENTAGE/>% reduced damage.<br/><Bullet/> <Ability:STRAIN_MIND_COOLDOWN/> turn cooldown.<br/>"

[BS_MCDetonate X2AbilityTemplate]
LocFriendlyName="Mind Burst"
LocLongDescription="Overloads a mind-controlled target's brain with Psionic energy until it bursts in a violent explosion. Deals Psionic damage equal to <Ability:MC_DETONATE_DAMAGE_WILL_FRACTION/>% of the target's Will stat to all targets within <Ability:MC_DETONATE_RADIUS/> tiles." 
LocHelpText="Deals Psionic damage equal to <Ability:MC_DETONATE_DAMAGE_WILL_FRACTION/>% of the target's Will stat to all targets within <Ability:MC_DETONATE_RADIUS/> tiles."
LocFlyOverText="Mind Burst"
LocPromotionPopupText="<Bullet/> Can be used on targets mind-controlled by the soldier using Insanity or Domination.<br/>"

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;					ARC THROWER ABILITIES						;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
[BS_ThatsCloseEnough X2AbilityTemplate]
LocFriendlyName="That's Close Enough"
LocFlyOverText="That's Close Enough"
LocLongDescription="During enemy turns, fire your arcthrower at any visible enemy within <Ability:THATS_CLOSE_ENOUGH_TILE_RANGE/> tiles who moves or fires."
LocHelpText="During enemy turns, fire your arcthrower at any visible enemy within four tiles who moves or fires."
LocPromotionPopupText="<Bullet/> Will not trigger if soldier is concealed.<br/><Bullet/> This ability can trigger <Ability:THATS_CLOSE_ENOUGH_PER_TARGET_COOLDOWN/> time(s) per turn.<br/>"

[BS_RapidStun X2AbilityTemplate]
LocFriendlyName="Quick Zap"
LocFlyOverText="Quick Zap"
LocLongDescription="Activate this ability to make your next arcthrower shot a free action. <Ability:RAPID_STUN_COOLDOWN/> turn cooldown."
LocHelpText="Activate this ability to make your next arcthrower shot a free action. <Ability:RAPID_STUN_COOLDOWN/> turn cooldown."
LocPromotionPopupText="<Bullet/> Activate this ability to make your next arcthrower shot a free action. <Ability:RAPID_STUN_COOLDOWN/> turn cooldown.<br/><Bullet/> Applies to the abilities Stun, Arc Pulser as well as Chain Lightning.<br/>"

[BS_SpareBattery X2AbilityTemplate]
LocFriendlyName="Spare Battery"
LocLongDescription="Quickly recharge your Arc Thrower's battery with a spare, reducing all related cooldowns by up to 3 turns. <Ability:SPARE_BATTERY_COOLDOWN/>  turn cooldown."
LocHelpText="Recharge your Arc Thrower skills."
LocFlyOverText="Spare Battery"
LocPromotionPopupText="<Bullet/> Reduces cooldowns of the perks Stun, Arc Pulser, Quick Zap and Chain Lightning. <br/><Bullet/> Has a cooldown of <Ability:SPARE_BATTERY_COOLDOWN/> turns.<br/><Bullet/> Activation costs <Ability:SPARE_BATTERY_ACTION_POINT_COST/> action point(s)."


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;					SAWED-OFF ABILITIES							;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

[BS_SawnOffReload X2AbilityTemplate]
LocFriendlyName="Reload Sawed-Off Shotgun"
LocLongDescription="Allows reloading of the Sawed-Off Shotgun <Ability:SAWNOFFRELOAD_CHARGES/> times per mission. Loads 1 ammo each time."
LocHelpText="Reload your Sawed-Off Shotgun."
LocFlyOverText="Reloading"
LocPromotionPopupText="<Bullet/> Allows reloading of the Sawed-Off Shotgun.<br/><Bullet/> Has <Ability:SAWNOFFRELOAD_CHARGES/> uses per mission.<br/><Bullet/> Reloads 1 ammo at a time.<br/><Bullet/> The number of uses can be increased with the Deep Pockets ability and uses can be restored with the Scrap Metal ability.<br/>"

[BS_ShotgunTap X2AbilityTemplate]
LocFriendlyName="Hipfire"
LocLongDescription="Firing one barrel of the Sawed-Off Shotgun with Point Blank no longer ends the turn."
LocHelpText="Firing one barrel of the Sawed-Off Shotgun with Point Blank no longer ends the turn."
LocFlyOverText="Hipfire"
LocPromotionPopupText="<Bullet/> Point Blank only requires one action to fire so can be used twice, after moving or before moving.<br/><Bullet/>"


[BS_SingleTap X2AbilityTemplate]
LocFriendlyName="Point Blank"
LocLongDescription="Fire your Sawed-Off Shotgun at a nearby enemy. This only costs 1 action."
LocHelpText="Fire your Sawed-Off Shotgun. Costs 1 action and does not end the turn."
LocFlyOverText="Single Tap"
LocPromotionPopupText="<Bullet/> Fire your Sawed-Off Shotgun at a nearby enemy.<br/><Bullet/> Rapidly loses power beyond three tiles range.<br/><Bullet/> Requires just 1 action point to fire.<br/><Bullet/> Uses one ammo.<br/>"

[BS_DoubleTap X2AbilityTemplate]
LocFriendlyName="Double Tap"
LocLongDescription="Fire your Sawed-Off Shotgun at a nearby enemy, if the attack misses or fails to kill the target take a second shot. Costs 2 actions and ends the turn."
LocHelpText="Fire your Sawed-Off Shotgun at a nearby enemy, if the attack misses or fails to kill the target take a second shot."
LocFlyOverText="Double Tap"
LocPromotionPopupText="<Bullet/> Fire your Sawed-Off Shotgun at a nearby enemy, if the attack misses or fails to kill the target take a secand shot.<br/><Bullet/> Rapidly loses accuracy beyond four tiles range.<br/><Bullet/> Requires 2 action points to fire.<br/><Bullet/> Uses two Ammo.<br/>"

[BS_DeepPockets X2AbilityTemplate]
LocFriendlyName="Deep Pockets"
LocFlyOverText="Deep Pockets"
LocLongDescription="Gain <Ability:DEEP_POCKETS_CHARGES_CV/> / <Ability:DEEP_POCKETS_CHARGES_MG/> / <Ability:DEEP_POCKETS_CHARGES_BM/> additional uses for the Reload Sawed-Off Shotgun ability."
LocHelpText="Gain <Ability:DEEP_POCKETS_CHARGES_CV/> / <Ability:DEEP_POCKETS_CHARGES_MG/> / <Ability:DEEP_POCKETS_CHARGES_BM/> additional uses for the Reload Sawed-Off Shotgun ability."
LocPromotionPopupText="<Bullet/> Higher tech levels increase the number uses gained through this ability.<br/>"

[BS_SawedOffOverwatch X2AbilityTemplate]
LocFriendlyName="None Shall Pass"
LocFlyOverText="None Shall Pass"
LocLongDescription="During enemy turns, fire a free reaction shot that can critically hit with your Sawed-Off Shotgun at any visible enemy within <Ability:NONE_SHALL_PASS_TILE_RANGE/> tiles who moves or fires. Can only trigger once per turn."
LocHelpText="During enemy turns, fire a free reaction shot that can critically hit with your Sawed-Off Shotgun at any visible enemy within <Ability:NONE_SHALL_PASS_TILE_RANGE/> tiles who moves or fires."
LocPromotionPopupText="<Bullet/> Will not trigger if soldier is concealed.<br/><Bullet/> Only triggers once per turn.<br/><Bullet/> Uses 1 ammo and will only trigger if the Sawed-Off Shotgun is loaded.<br/><Bullet/> Can critically hit.<br/>"

[BS_ScrapMetal X2AbilityTemplate]
LocFriendlyName="Scrap Metal"
LocFlyOverText="Scrap Metal: Recovered ammo"
LocLongDescription="Kills on robotic enemies with your Sawed-Off Shotgun restore one use of the Reload Sawed-Off Shotgun ability. Your Sawed-Off Shotgun attacks against robotic enemies pierce <Ability:SCRAP_METAL_PIERCE_CV/> / <Ability:SCRAP_METAL_PIERCE_MG/> / <Ability:SCRAP_METAL_PIERCE_BM/> armor."
LocHelpText="Kills with the Sawed-Off Shotgun on robotic enemies restore one use of the Reload Sawed-Off Shotgun ability. Your Sawed-Off Shotgun attacks against robotic enemies pierce armor."
LocPromotionPopupText="<Bullet/> If you kill a robotic unit with Point Blank, you regain all ammo lost. Strategically using the Sawed-Off Shotgun to kill robots can help you manage armor during longer missions. <br/><Bullet/> Higher tech levels increase the armor piercing of your Sawed-Off Shotgun.<br/>"

[BS_ScrapMetalTrigger X2AbilityTemplate]
LocFriendlyName="Scrap Metal: Recovered ammo"

[BS_Brutality X2AbilityTemplate]
LocFriendlyName="Brutality"
LocLongDescription="Kills on organic enemies with your Sawed-Off Shotgun have a <Ability:BRUTALITY_PANIC_CHANCE/> chance to panic other organic enemies within <Ability:BRUTALITY_TILE_RADIUS/> tiles."
LocHelpText="Kills on organic enemies with your Sawed-Off Shotgun have a <Ability:BRUTALITY_PANIC_CHANCE/> chance to panic other organic enemies within <Ability:BRUTALITY_TILE_RADIUS/> tiles."
LocFlyOverText="Brutality"
LocPromotionPopupText="<Bullet/> Use Brutality as a crowd control tool to allow the Marauder to move forward more aggressively and combine it with the Ruthless ability to increase your killing power.<br/>"

[BS_Ruthless X2AbilityTemplate]
LocFriendlyName="Ruthless"
LocLongDescription="Killing a panicked or disoriented enemy with your Sawed-Off Shotgun refunds one action point."
LocHelpText="Killing a panicked or disoriented enemy with your Sawed-Off Shotgun refunds one action point."
LocFlyOverText="Ruthless"
LocPromotionPopupText="<Bullet/> By cleverly combining the effects of Brutality and Ruthless, you can kill multiple enemies per turn with your Sawed-Off Shotgun.<br/><Bullet/> There is no limit to the number of activations per turn.<br/>"



;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;					UTILITY ITEM ABILITIES						;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

[BS_BattleScannerCrit X2AbilityTemplate]
LocFriendlyName="Battle Scanner Crit"
LocLongDescription="Your Battlescanners now <Ability:MC_DETONATE_DAMAGE_WILL_FRACTION/>% of the target's Will stat to all targets within <Ability:MC_DETONATE_RADIUS/> tiles." 
LocHelpText="Deals Psionic damage equal to <Ability:MC_DETONATE_DAMAGE_WILL_FRACTION/>% of the target's Will stat to all targets within <Ability:MC_DETONATE_RADIUS/> tiles."
LocFlyOverText="Mind Burst"
LocPromotionPopupText="<Bullet/> Can be used on targets mind-controlled by the soldier using Insanity or Domination.<br/>"


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;					LW2 ABILITIES - IMPORTED					;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

[BS_Bastion X2AbilityTemplate]
LocFriendlyName="Bastion"
LocLongDescription="Fortress now provides immunity to nearby teammates."
LocHelpText="Fortress now provides immunity to nearby teammates."
LocFlyOverText="Bastion"
LocPromotionPopupText="<Bullet/> Bastion has a 4 tile radius.<br/><Bullet/> Moving next to afflicted allies will immediately cleanse their negative physical status effects.<br/>"

[BS_Bastion_Passive X2AbilityTemplate]
LocFriendlyName="Bastion"
LocLongDescription="Fortress now provides immunity to nearby teammates."
LocHelpText="Fortress now provides immunity to nearby teammates."
LocFlyOverText="Bastion"
LocPromotionPopupText="<Bullet/> Bastion has a 4 tile radius.<br/><Bullet/> Moving next to afflicted allies will immediately cleanse their negative physical status effects.<br/>"

[BS_Bastion_Cleanse X2AbilityTemplate]
LocFriendlyName="Bastion"
LocLongDescription="Fortress now provides immunity to nearby teammates."
LocHelpText="Fortress now provides immunity to nearby teammates."
LocFlyOverText="Bastion"
LocPromotionPopupText="<Bullet/> Bastion has a 4 tile radius.<br/><Bullet/> Moving next to afflicted allies will immediately cleanse their negative physical status effects.<br/>"
